Figure/Figure 5/simulations/parametrization/Ap4dp2T7/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    //default         backward;
    default         CrankNicolson 0.5;
}

gradSchemes
{
    default 	     leastSquares;
  //default 	     cellMDLimited leastSquares 0.5;
  //default 	     cellMDLimited Gauss linear 1;

    grad(U) 	     cellMDLimited Gauss linear 1;
}

divSchemes
{
    default         none;
  //div(phi,U)      Gauss linear;
  //div(phi,U)      Gauss limitedLinearV 1;

  //div(phi,U)      Gauss linearUpwind default;
    div(phi,U)      Gauss linearUpwindV grad(U);

    div((nuEff*dev2(T(grad(U)))))	Gauss linear;

    div(phi,k)      Gauss linearUpwind default;

    div(phi,omega)  Gauss linearUpwind default;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
//  default         corrected;
    default         limited 1;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
